In [1]:
import pandas as pd

In [32]:
data = {"job_role": "job_role_Manager", "work_location": "work_location_Manhattan, NY"}

In [33]:
querydf = pd.DataFrame([data])

In [34]:
querydf

           job_role                work_location
0  job_role_Manager  work_location_Manhattan, NY

In [35]:
querydf[querydf.iloc[0,1]] = 1

In [36]:
querydf

           job_role                work_location  work_location_Manhattan, NY
0  job_role_Manager  work_location_Manhattan, NY                            1

In [37]:
model = pd.DataFrame([[]])

In [42]:
model[querydf.iloc[0,1]] = 1

In [43]:
model

   1  work_location_Manhattan, NY
0  1                            1

In [44]:
newdf = pd.DataFrame([[]])

In [45]:
newdf[querydf.iloc[0,1]] = 2

In [46]:
newdf

   work_location_Manhattan, NY
0                            2

In [47]:
df = pd.concat([model, newdf])

In [48]:
df

     1  work_location_Manhattan, NY
0  1.0                            1
0  NaN                            2

In [49]:
model

   1  work_location_Manhattan, NY
0  1                            1

In [50]:
newdf

   work_location_Manhattan, NY
0                            2

In [51]:
model.update(newdf)

In [52]:
model

   1  work_location_Manhattan, NY
0  1                            2

In [55]:
data = {
    'work_location_Atlanta, GA': [0],
    'work_location_Austin, TX': [0],
    'work_location_Bronx, NY': [0],
    'work_location_Brooklyn, NY': [0],
    'work_location_Chicago, IL': [0],
    'work_location_Hartford, CT': [0],
    'work_location_Los Angeles, CA': [0],
    'work_location_Manhattan, NY': [0],
    'work_location_New Haven, CT': [0],
    'work_location_Newington, CT': [0],
    'work_location_Norwalk, CT': [0],
    'work_location_Queens, NY': [0],
    'work_location_South Windsor, CT': [0],
    'work_location_St Paul, MN': [0],
    'work_location_West Hartford, CT': [0],
    'job_role_Employee': [0],
    'job_role_HR': [0],
    'job_role_Manager': [0]
}

# Create DataFrame
datadf = pd.DataFrame(data)

In [56]:
datadf

,"work_location_Atlanta, GA","work_location_Austin, TX","work_location_Bronx, NY","work_location_Brooklyn, NY","work_location_Chicago, IL","work_location_Hartford, CT","work_location_Los Angeles, CA","work_location_Manhattan, NY","work_location_New Haven, CT","work_location_Newington, CT","work_location_Norwalk, CT","work_location_Queens, NY","work_location_South Windsor, CT","work_location_St Paul, MN","work_location_West Hartford, CT",job_role_Employee,job_role_HR,job_role_Manager
0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0

In [57]:
datadf.update(model)

In [58]:
datadf

,"work_location_Atlanta, GA","work_location_Austin, TX","work_location_Bronx, NY","work_location_Brooklyn, NY","work_location_Chicago, IL","work_location_Hartford, CT","work_location_Los Angeles, CA","work_location_Manhattan, NY","work_location_New Haven, CT","work_location_Newington, CT","work_location_Norwalk, CT","work_location_Queens, NY","work_location_South Windsor, CT","work_location_St Paul, MN","work_location_West Hartford, CT",job_role_Employee,job_role_HR,job_role_Manager
0,0,0,0,0,0,0,0,2,0,0,0,0,0,0,0,0,0,0